; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l6-t1-p12---int100n150-m25---int100c150---s298---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 l4 l5 - location
t0 - truck
p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 level65 level66 level67 level68 level69 level70 level71 level72 level73 level74 level75 level76 level77 level78 level79 level80 level81 level82 level83 level84 level85 level86 level87 level88 level89 level90 level91 level92 level93 level94 level95 level96 level97 level98 level99 level100 level101 level102 level103 level104 level105 level106 level107 level108 level109 level110 level111 level112 level113 level114 level115 level116 level117 level118 level119 level120 level121 - fuellevel
)

(:init
(sum level0 level1 level1)
(sum level0 level5 level5)
(sum level0 level10 level10)
(sum level0 level11 level11)
(sum level0 level12 level12)
(sum level0 level21 level21)
(sum level0 level25 level25)
(sum level1 level1 level2)
(sum level1 level5 level6)
(sum level1 level10 level11)
(sum level1 level11 level12)
(sum level1 level12 level13)
(sum level1 level21 level22)
(sum level1 level25 level26)
(sum level2 level1 level3)
(sum level2 level5 level7)
(sum level2 level10 level12)
(sum level2 level11 level13)
(sum level2 level12 level14)
(sum level2 level21 level23)
(sum level2 level25 level27)
(sum level3 level1 level4)
(sum level3 level5 level8)
(sum level3 level10 level13)
(sum level3 level11 level14)
(sum level3 level12 level15)
(sum level3 level21 level24)
(sum level3 level25 level28)
(sum level4 level1 level5)
(sum level4 level5 level9)
(sum level4 level10 level14)
(sum level4 level11 level15)
(sum level4 level12 level16)
(sum level4 level21 level25)
(sum level4 level25 level29)
(sum level5 level1 level6)
(sum level5 level5 level10)
(sum level5 level10 level15)
(sum level5 level11 level16)
(sum level5 level12 level17)
(sum level5 level21 level26)
(sum level5 level25 level30)
(sum level6 level1 level7)
(sum level6 level5 level11)
(sum level6 level10 level16)
(sum level6 level11 level17)
(sum level6 level12 level18)
(sum level6 level21 level27)
(sum level6 level25 level31)
(sum level7 level1 level8)
(sum level7 level5 level12)
(sum level7 level10 level17)
(sum level7 level11 level18)
(sum level7 level12 level19)
(sum level7 level21 level28)
(sum level7 level25 level32)
(sum level8 level1 level9)
(sum level8 level5 level13)
(sum level8 level10 level18)
(sum level8 level11 level19)
(sum level8 level12 level20)
(sum level8 level21 level29)
(sum level8 level25 level33)
(sum level9 level1 level10)
(sum level9 level5 level14)
(sum level9 level10 level19)
(sum level9 level11 level20)
(sum level9 level12 level21)
(sum level9 level21 level30)
(sum level9 level25 level34)
(sum level10 level1 level11)
(sum level10 level5 level15)
(sum level10 level10 level20)
(sum level10 level11 level21)
(sum level10 level12 level22)
(sum level10 level21 level31)
(sum level10 level25 level35)
(sum level11 level1 level12)
(sum level11 level5 level16)
(sum level11 level10 level21)
(sum level11 level11 level22)
(sum level11 level12 level23)
(sum level11 level21 level32)
(sum level11 level25 level36)
(sum level12 level1 level13)
(sum level12 level5 level17)
(sum level12 level10 level22)
(sum level12 level11 level23)
(sum level12 level12 level24)
(sum level12 level21 level33)
(sum level12 level25 level37)
(sum level13 level1 level14)
(sum level13 level5 level18)
(sum level13 level10 level23)
(sum level13 level11 level24)
(sum level13 level12 level25)
(sum level13 level21 level34)
(sum level13 level25 level38)
(sum level14 level1 level15)
(sum level14 level5 level19)
(sum level14 level10 level24)
(sum level14 level11 level25)
(sum level14 level12 level26)
(sum level14 level21 level35)
(sum level14 level25 level39)
(sum level15 level1 level16)
(sum level15 level5 level20)
(sum level15 level10 level25)
(sum level15 level11 level26)
(sum level15 level12 level27)
(sum level15 level21 level36)
(sum level15 level25 level40)
(sum level16 level1 level17)
(sum level16 level5 level21)
(sum level16 level10 level26)
(sum level16 level11 level27)
(sum level16 level12 level28)
(sum level16 level21 level37)
(sum level16 level25 level41)
(sum level17 level1 level18)
(sum level17 level5 level22)
(sum level17 level10 level27)
(sum level17 level11 level28)
(sum level17 level12 level29)
(sum level17 level21 level38)
(sum level17 level25 level42)
(sum level18 level1 level19)
(sum level18 level5 level23)
(sum level18 level10 level28)
(sum level18 level11 level29)
(sum level18 level12 level30)
(sum level18 level21 level39)
(sum level18 level25 level43)
(sum level19 level1 level20)
(sum level19 level5 level24)
(sum level19 level10 level29)
(sum level19 level11 level30)
(sum level19 level12 level31)
(sum level19 level21 level40)
(sum level19 level25 level44)
(sum level20 level1 level21)
(sum level20 level5 level25)
(sum level20 level10 level30)
(sum level20 level11 level31)
(sum level20 level12 level32)
(sum level20 level21 level41)
(sum level20 level25 level45)
(sum level21 level1 level22)
(sum level21 level5 level26)
(sum level21 level10 level31)
(sum level21 level11 level32)
(sum level21 level12 level33)
(sum level21 level21 level42)
(sum level21 level25 level46)
(sum level22 level1 level23)
(sum level22 level5 level27)
(sum level22 level10 level32)
(sum level22 level11 level33)
(sum level22 level12 level34)
(sum level22 level21 level43)
(sum level22 level25 level47)
(sum level23 level1 level24)
(sum level23 level5 level28)
(sum level23 level10 level33)
(sum level23 level11 level34)
(sum level23 level12 level35)
(sum level23 level21 level44)
(sum level23 level25 level48)
(sum level24 level1 level25)
(sum level24 level5 level29)
(sum level24 level10 level34)
(sum level24 level11 level35)
(sum level24 level12 level36)
(sum level24 level21 level45)
(sum level24 level25 level49)
(sum level25 level1 level26)
(sum level25 level5 level30)
(sum level25 level10 level35)
(sum level25 level11 level36)
(sum level25 level12 level37)
(sum level25 level21 level46)
(sum level25 level25 level50)
(sum level26 level1 level27)
(sum level26 level5 level31)
(sum level26 level10 level36)
(sum level26 level11 level37)
(sum level26 level12 level38)
(sum level26 level21 level47)
(sum level26 level25 level51)
(sum level27 level1 level28)
(sum level27 level5 level32)
(sum level27 level10 level37)
(sum level27 level11 level38)
(sum level27 level12 level39)
(sum level27 level21 level48)
(sum level27 level25 level52)
(sum level28 level1 level29)
(sum level28 level5 level33)
(sum level28 level10 level38)
(sum level28 level11 level39)
(sum level28 level12 level40)
(sum level28 level21 level49)
(sum level28 level25 level53)
(sum level29 level1 level30)
(sum level29 level5 level34)
(sum level29 level10 level39)
(sum level29 level11 level40)
(sum level29 level12 level41)
(sum level29 level21 level50)
(sum level29 level25 level54)
(sum level30 level1 level31)
(sum level30 level5 level35)
(sum level30 level10 level40)
(sum level30 level11 level41)
(sum level30 level12 level42)
(sum level30 level21 level51)
(sum level30 level25 level55)
(sum level31 level1 level32)
(sum level31 level5 level36)
(sum level31 level10 level41)
(sum level31 level11 level42)
(sum level31 level12 level43)
(sum level31 level21 level52)
(sum level31 level25 level56)
(sum level32 level1 level33)
(sum level32 level5 level37)
(sum level32 level10 level42)
(sum level32 level11 level43)
(sum level32 level12 level44)
(sum level32 level21 level53)
(sum level32 level25 level57)
(sum level33 level1 level34)
(sum level33 level5 level38)
(sum level33 level10 level43)
(sum level33 level11 level44)
(sum level33 level12 level45)
(sum level33 level21 level54)
(sum level33 level25 level58)
(sum level34 level1 level35)
(sum level34 level5 level39)
(sum level34 level10 level44)
(sum level34 level11 level45)
(sum level34 level12 level46)
(sum level34 level21 level55)
(sum level34 level25 level59)
(sum level35 level1 level36)
(sum level35 level5 level40)
(sum level35 level10 level45)
(sum level35 level11 level46)
(sum level35 level12 level47)
(sum level35 level21 level56)
(sum level35 level25 level60)
(sum level36 level1 level37)
(sum level36 level5 level41)
(sum level36 level10 level46)
(sum level36 level11 level47)
(sum level36 level12 level48)
(sum level36 level21 level57)
(sum level36 level25 level61)
(sum level37 level1 level38)
(sum level37 level5 level42)
(sum level37 level10 level47)
(sum level37 level11 level48)
(sum level37 level12 level49)
(sum level37 level21 level58)
(sum level37 level25 level62)
(sum level38 level1 level39)
(sum level38 level5 level43)
(sum level38 level10 level48)
(sum level38 level11 level49)
(sum level38 level12 level50)
(sum level38 level21 level59)
(sum level38 level25 level63)
(sum level39 level1 level40)
(sum level39 level5 level44)
(sum level39 level10 level49)
(sum level39 level11 level50)
(sum level39 level12 level51)
(sum level39 level21 level60)
(sum level39 level25 level64)
(sum level40 level1 level41)
(sum level40 level5 level45)
(sum level40 level10 level50)
(sum level40 level11 level51)
(sum level40 level12 level52)
(sum level40 level21 level61)
(sum level40 level25 level65)
(sum level41 level1 level42)
(sum level41 level5 level46)
(sum level41 level10 level51)
(sum level41 level11 level52)
(sum level41 level12 level53)
(sum level41 level21 level62)
(sum level41 level25 level66)
(sum level42 level1 level43)
(sum level42 level5 level47)
(sum level42 level10 level52)
(sum level42 level11 level53)
(sum level42 level12 level54)
(sum level42 level21 level63)
(sum level42 level25 level67)
(sum level43 level1 level44)
(sum level43 level5 level48)
(sum level43 level10 level53)
(sum level43 level11 level54)
(sum level43 level12 level55)
(sum level43 level21 level64)
(sum level43 level25 level68)
(sum level44 level1 level45)
(sum level44 level5 level49)
(sum level44 level10 level54)
(sum level44 level11 level55)
(sum level44 level12 level56)
(sum level44 level21 level65)
(sum level44 level25 level69)
(sum level45 level1 level46)
(sum level45 level5 level50)
(sum level45 level10 level55)
(sum level45 level11 level56)
(sum level45 level12 level57)
(sum level45 level21 level66)
(sum level45 level25 level70)
(sum level46 level1 level47)
(sum level46 level5 level51)
(sum level46 level10 level56)
(sum level46 level11 level57)
(sum level46 level12 level58)
(sum level46 level21 level67)
(sum level46 level25 level71)
(sum level47 level1 level48)
(sum level47 level5 level52)
(sum level47 level10 level57)
(sum level47 level11 level58)
(sum level47 level12 level59)
(sum level47 level21 level68)
(sum level47 level25 level72)
(sum level48 level1 level49)
(sum level48 level5 level53)
(sum level48 level10 level58)
(sum level48 level11 level59)
(sum level48 level12 level60)
(sum level48 level21 level69)
(sum level48 level25 level73)
(sum level49 level1 level50)
(sum level49 level5 level54)
(sum level49 level10 level59)
(sum level49 level11 level60)
(sum level49 level12 level61)
(sum level49 level21 level70)
(sum level49 level25 level74)
(sum level50 level1 level51)
(sum level50 level5 level55)
(sum level50 level10 level60)
(sum level50 level11 level61)
(sum level50 level12 level62)
(sum level50 level21 level71)
(sum level50 level25 level75)
(sum level51 level1 level52)
(sum level51 level5 level56)
(sum level51 level10 level61)
(sum level51 level11 level62)
(sum level51 level12 level63)
(sum level51 level21 level72)
(sum level51 level25 level76)
(sum level52 level1 level53)
(sum level52 level5 level57)
(sum level52 level10 level62)
(sum level52 level11 level63)
(sum level52 level12 level64)
(sum level52 level21 level73)
(sum level52 level25 level77)
(sum level53 level1 level54)
(sum level53 level5 level58)
(sum level53 level10 level63)
(sum level53 level11 level64)
(sum level53 level12 level65)
(sum level53 level21 level74)
(sum level53 level25 level78)
(sum level54 level1 level55)
(sum level54 level5 level59)
(sum level54 level10 level64)
(sum level54 level11 level65)
(sum level54 level12 level66)
(sum level54 level21 level75)
(sum level54 level25 level79)
(sum level55 level1 level56)
(sum level55 level5 level60)
(sum level55 level10 level65)
(sum level55 level11 level66)
(sum level55 level12 level67)
(sum level55 level21 level76)
(sum level55 level25 level80)
(sum level56 level1 level57)
(sum level56 level5 level61)
(sum level56 level10 level66)
(sum level56 level11 level67)
(sum level56 level12 level68)
(sum level56 level21 level77)
(sum level56 level25 level81)
(sum level57 level1 level58)
(sum level57 level5 level62)
(sum level57 level10 level67)
(sum level57 level11 level68)
(sum level57 level12 level69)
(sum level57 level21 level78)
(sum level57 level25 level82)
(sum level58 level1 level59)
(sum level58 level5 level63)
(sum level58 level10 level68)
(sum level58 level11 level69)
(sum level58 level12 level70)
(sum level58 level21 level79)
(sum level58 level25 level83)
(sum level59 level1 level60)
(sum level59 level5 level64)
(sum level59 level10 level69)
(sum level59 level11 level70)
(sum level59 level12 level71)
(sum level59 level21 level80)
(sum level59 level25 level84)
(sum level60 level1 level61)
(sum level60 level5 level65)
(sum level60 level10 level70)
(sum level60 level11 level71)
(sum level60 level12 level72)
(sum level60 level21 level81)
(sum level60 level25 level85)
(sum level61 level1 level62)
(sum level61 level5 level66)
(sum level61 level10 level71)
(sum level61 level11 level72)
(sum level61 level12 level73)
(sum level61 level21 level82)
(sum level61 level25 level86)
(sum level62 level1 level63)
(sum level62 level5 level67)
(sum level62 level10 level72)
(sum level62 level11 level73)
(sum level62 level12 level74)
(sum level62 level21 level83)
(sum level62 level25 level87)
(sum level63 level1 level64)
(sum level63 level5 level68)
(sum level63 level10 level73)
(sum level63 level11 level74)
(sum level63 level12 level75)
(sum level63 level21 level84)
(sum level63 level25 level88)
(sum level64 level1 level65)
(sum level64 level5 level69)
(sum level64 level10 level74)
(sum level64 level11 level75)
(sum level64 level12 level76)
(sum level64 level21 level85)
(sum level64 level25 level89)
(sum level65 level1 level66)
(sum level65 level5 level70)
(sum level65 level10 level75)
(sum level65 level11 level76)
(sum level65 level12 level77)
(sum level65 level21 level86)
(sum level65 level25 level90)
(sum level66 level1 level67)
(sum level66 level5 level71)
(sum level66 level10 level76)
(sum level66 level11 level77)
(sum level66 level12 level78)
(sum level66 level21 level87)
(sum level66 level25 level91)
(sum level67 level1 level68)
(sum level67 level5 level72)
(sum level67 level10 level77)
(sum level67 level11 level78)
(sum level67 level12 level79)
(sum level67 level21 level88)
(sum level67 level25 level92)
(sum level68 level1 level69)
(sum level68 level5 level73)
(sum level68 level10 level78)
(sum level68 level11 level79)
(sum level68 level12 level80)
(sum level68 level21 level89)
(sum level68 level25 level93)
(sum level69 level1 level70)
(sum level69 level5 level74)
(sum level69 level10 level79)
(sum level69 level11 level80)
(sum level69 level12 level81)
(sum level69 level21 level90)
(sum level69 level25 level94)
(sum level70 level1 level71)
(sum level70 level5 level75)
(sum level70 level10 level80)
(sum level70 level11 level81)
(sum level70 level12 level82)
(sum level70 level21 level91)
(sum level70 level25 level95)
(sum level71 level1 level72)
(sum level71 level5 level76)
(sum level71 level10 level81)
(sum level71 level11 level82)
(sum level71 level12 level83)
(sum level71 level21 level92)
(sum level71 level25 level96)
(sum level72 level1 level73)
(sum level72 level5 level77)
(sum level72 level10 level82)
(sum level72 level11 level83)
(sum level72 level12 level84)
(sum level72 level21 level93)
(sum level72 level25 level97)
(sum level73 level1 level74)
(sum level73 level5 level78)
(sum level73 level10 level83)
(sum level73 level11 level84)
(sum level73 level12 level85)
(sum level73 level21 level94)
(sum level73 level25 level98)
(sum level74 level1 level75)
(sum level74 level5 level79)
(sum level74 level10 level84)
(sum level74 level11 level85)
(sum level74 level12 level86)
(sum level74 level21 level95)
(sum level74 level25 level99)
(sum level75 level1 level76)
(sum level75 level5 level80)
(sum level75 level10 level85)
(sum level75 level11 level86)
(sum level75 level12 level87)
(sum level75 level21 level96)
(sum level75 level25 level100)
(sum level76 level1 level77)
(sum level76 level5 level81)
(sum level76 level10 level86)
(sum level76 level11 level87)
(sum level76 level12 level88)
(sum level76 level21 level97)
(sum level76 level25 level101)
(sum level77 level1 level78)
(sum level77 level5 level82)
(sum level77 level10 level87)
(sum level77 level11 level88)
(sum level77 level12 level89)
(sum level77 level21 level98)
(sum level77 level25 level102)
(sum level78 level1 level79)
(sum level78 level5 level83)
(sum level78 level10 level88)
(sum level78 level11 level89)
(sum level78 level12 level90)
(sum level78 level21 level99)
(sum level78 level25 level103)
(sum level79 level1 level80)
(sum level79 level5 level84)
(sum level79 level10 level89)
(sum level79 level11 level90)
(sum level79 level12 level91)
(sum level79 level21 level100)
(sum level79 level25 level104)
(sum level80 level1 level81)
(sum level80 level5 level85)
(sum level80 level10 level90)
(sum level80 level11 level91)
(sum level80 level12 level92)
(sum level80 level21 level101)
(sum level80 level25 level105)
(sum level81 level1 level82)
(sum level81 level5 level86)
(sum level81 level10 level91)
(sum level81 level11 level92)
(sum level81 level12 level93)
(sum level81 level21 level102)
(sum level81 level25 level106)
(sum level82 level1 level83)
(sum level82 level5 level87)
(sum level82 level10 level92)
(sum level82 level11 level93)
(sum level82 level12 level94)
(sum level82 level21 level103)
(sum level82 level25 level107)
(sum level83 level1 level84)
(sum level83 level5 level88)
(sum level83 level10 level93)
(sum level83 level11 level94)
(sum level83 level12 level95)
(sum level83 level21 level104)
(sum level83 level25 level108)
(sum level84 level1 level85)
(sum level84 level5 level89)
(sum level84 level10 level94)
(sum level84 level11 level95)
(sum level84 level12 level96)
(sum level84 level21 level105)
(sum level84 level25 level109)
(sum level85 level1 level86)
(sum level85 level5 level90)
(sum level85 level10 level95)
(sum level85 level11 level96)
(sum level85 level12 level97)
(sum level85 level21 level106)
(sum level85 level25 level110)
(sum level86 level1 level87)
(sum level86 level5 level91)
(sum level86 level10 level96)
(sum level86 level11 level97)
(sum level86 level12 level98)
(sum level86 level21 level107)
(sum level86 level25 level111)
(sum level87 level1 level88)
(sum level87 level5 level92)
(sum level87 level10 level97)
(sum level87 level11 level98)
(sum level87 level12 level99)
(sum level87 level21 level108)
(sum level87 level25 level112)
(sum level88 level1 level89)
(sum level88 level5 level93)
(sum level88 level10 level98)
(sum level88 level11 level99)
(sum level88 level12 level100)
(sum level88 level21 level109)
(sum level88 level25 level113)
(sum level89 level1 level90)
(sum level89 level5 level94)
(sum level89 level10 level99)
(sum level89 level11 level100)
(sum level89 level12 level101)
(sum level89 level21 level110)
(sum level89 level25 level114)
(sum level90 level1 level91)
(sum level90 level5 level95)
(sum level90 level10 level100)
(sum level90 level11 level101)
(sum level90 level12 level102)
(sum level90 level21 level111)
(sum level90 level25 level115)
(sum level91 level1 level92)
(sum level91 level5 level96)
(sum level91 level10 level101)
(sum level91 level11 level102)
(sum level91 level12 level103)
(sum level91 level21 level112)
(sum level91 level25 level116)
(sum level92 level1 level93)
(sum level92 level5 level97)
(sum level92 level10 level102)
(sum level92 level11 level103)
(sum level92 level12 level104)
(sum level92 level21 level113)
(sum level92 level25 level117)
(sum level93 level1 level94)
(sum level93 level5 level98)
(sum level93 level10 level103)
(sum level93 level11 level104)
(sum level93 level12 level105)
(sum level93 level21 level114)
(sum level93 level25 level118)
(sum level94 level1 level95)
(sum level94 level5 level99)
(sum level94 level10 level104)
(sum level94 level11 level105)
(sum level94 level12 level106)
(sum level94 level21 level115)
(sum level94 level25 level119)
(sum level95 level1 level96)
(sum level95 level5 level100)
(sum level95 level10 level105)
(sum level95 level11 level106)
(sum level95 level12 level107)
(sum level95 level21 level116)
(sum level95 level25 level120)
(sum level96 level1 level97)
(sum level96 level5 level101)
(sum level96 level10 level106)
(sum level96 level11 level107)
(sum level96 level12 level108)
(sum level96 level21 level117)
(sum level96 level25 level121)
(sum level97 level1 level98)
(sum level97 level5 level102)
(sum level97 level10 level107)
(sum level97 level11 level108)
(sum level97 level12 level109)
(sum level97 level21 level118)
(sum level98 level1 level99)
(sum level98 level5 level103)
(sum level98 level10 level108)
(sum level98 level11 level109)
(sum level98 level12 level110)
(sum level98 level21 level119)
(sum level99 level1 level100)
(sum level99 level5 level104)
(sum level99 level10 level109)
(sum level99 level11 level110)
(sum level99 level12 level111)
(sum level99 level21 level120)
(sum level100 level1 level101)
(sum level100 level5 level105)
(sum level100 level10 level110)
(sum level100 level11 level111)
(sum level100 level12 level112)
(sum level100 level21 level121)
(sum level101 level1 level102)
(sum level101 level5 level106)
(sum level101 level10 level111)
(sum level101 level11 level112)
(sum level101 level12 level113)
(sum level102 level1 level103)
(sum level102 level5 level107)
(sum level102 level10 level112)
(sum level102 level11 level113)
(sum level102 level12 level114)
(sum level103 level1 level104)
(sum level103 level5 level108)
(sum level103 level10 level113)
(sum level103 level11 level114)
(sum level103 level12 level115)
(sum level104 level1 level105)
(sum level104 level5 level109)
(sum level104 level10 level114)
(sum level104 level11 level115)
(sum level104 level12 level116)
(sum level105 level1 level106)
(sum level105 level5 level110)
(sum level105 level10 level115)
(sum level105 level11 level116)
(sum level105 level12 level117)
(sum level106 level1 level107)
(sum level106 level5 level111)
(sum level106 level10 level116)
(sum level106 level11 level117)
(sum level106 level12 level118)
(sum level107 level1 level108)
(sum level107 level5 level112)
(sum level107 level10 level117)
(sum level107 level11 level118)
(sum level107 level12 level119)
(sum level108 level1 level109)
(sum level108 level5 level113)
(sum level108 level10 level118)
(sum level108 level11 level119)
(sum level108 level12 level120)
(sum level109 level1 level110)
(sum level109 level5 level114)
(sum level109 level10 level119)
(sum level109 level11 level120)
(sum level109 level12 level121)
(sum level110 level1 level111)
(sum level110 level5 level115)
(sum level110 level10 level120)
(sum level110 level11 level121)
(sum level111 level1 level112)
(sum level111 level5 level116)
(sum level111 level10 level121)
(sum level112 level1 level113)
(sum level112 level5 level117)
(sum level113 level1 level114)
(sum level113 level5 level118)
(sum level114 level1 level115)
(sum level114 level5 level119)
(sum level115 level1 level116)
(sum level115 level5 level120)
(sum level116 level1 level117)
(sum level116 level5 level121)
(sum level117 level1 level118)
(sum level118 level1 level119)
(sum level119 level1 level120)
(sum level120 level1 level121)

(connected l0 l4)
(fuelcost level1 l0 l4)
(connected l0 l5)
(fuelcost level10 l0 l5)
(connected l1 l2)
(fuelcost level21 l1 l2)
(connected l1 l3)
(fuelcost level11 l1 l3)
(connected l1 l4)
(fuelcost level25 l1 l4)
(connected l1 l5)
(fuelcost level21 l1 l5)
(connected l2 l1)
(fuelcost level21 l2 l1)
(connected l2 l4)
(fuelcost level25 l2 l4)
(connected l2 l5)
(fuelcost level5 l2 l5)
(connected l3 l1)
(fuelcost level11 l3 l1)
(connected l3 l4)
(fuelcost level12 l3 l4)
(connected l4 l0)
(fuelcost level1 l4 l0)
(connected l4 l1)
(fuelcost level25 l4 l1)
(connected l4 l2)
(fuelcost level25 l4 l2)
(connected l4 l3)
(fuelcost level12 l4 l3)
(connected l5 l0)
(fuelcost level10 l5 l0)
(connected l5 l1)
(fuelcost level21 l5 l1)
(connected l5 l2)
(fuelcost level5 l5 l2)

(at t0 l5)
(fuel t0 level121)
(= (total-cost) 0)

(at p0 l0)
(at p1 l1)
(at p2 l0)
(at p3 l0)
(at p4 l0)
(at p5 l0)
(at p6 l5)
(at p7 l5)
(at p8 l3)
(at p9 l0)
(at p10 l2)
(at p11 l2)
)

(:goal
(and
(at p0 l4)
(at p1 l2)
(at p2 l4)
(at p3 l1)
(at p4 l5)
(at p5 l2)
(at p6 l1)
(at p7 l0)
(at p8 l4)
(at p9 l5)
(at p10 l0)
(at p11 l3)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p7 t0 l5)
   deleted: (at p7 l5)
   added: (in p7 t0)
   goals met: 0 of 12
2. (drive t0 l5 l2 level116 level5 level121)
   deleted: (at t0 l5) (fuel t0 level121)
   added: (at t0 l2) (fuel t0 level116)
   goals met: 0 of 12
3. (load p11 t0 l2)
   deleted: (at p11 l2)
   added: (in p11 t0)
   goals met: 0 of 12
4. (load p10 t0 l2)
   deleted: (at p10 l2)
   added: (in p10 t0)
   goals met: 0 of 12
5. (drive t0 l2 l4 level91 level25 level116)
   deleted: (at t0 l2) (fuel t0 level116)
   added: (at t0 l4) (fuel t0 level91)
   goals met: 0 of 12
6. (drive t0 l4 l0 level90 level1 level91)
   deleted: (at t0 l4) (fuel t0 level91)
   added: (at t0 l0) (fuel t0 level90)
   goals met: 0 of 12
7. (unload p7 t0 l0)
   deleted: (in p7 t0)
   added: (at p7 l0)
   goals met: 1 of 12
8. (unload p10 t0 l0)
   deleted: (in p10 t0)
   added: (at p10 l0)
   goals met: 2 of 12
9. (load p9 t0 l0)
   deleted: (at p9 l0)
   added: (in p9 t0)
   goals met: 2 of 12
10. (load p5 t0 l0)
   deleted: (at p5 l0)
   added: (in p5 t0)
   goals met: 2 of 12
11. (load p4 t0 l0)
   deleted: (at p4 l0)
   added: (in p4 t0)
   goals met: 2 of 12
12. (load p3 t0 l0)
   deleted: (at p3 l0)
   added: (in p3 t0)
   goals met: 2 of 12
13. (load p2 t0 l0)
   deleted: (at p2 l0)
   added: (in p2 t0)
   goals met: 2 of 12
14. (load p0 t0 l0)
   deleted: (at p0 l0)
   added: (in p0 t0)
   goals met: 2 of 12
15. (drive t0 l0 l5 level80 level10 level90)
   deleted: (at t0 l0) (fuel t0 level90)
   added: (at t0 l5) (fuel t0 level80)
   goals met: 2 of 12
16. (unload p9 t0 l5)
   deleted: (in p9 t0)
   added: (at p9 l5)
   goals met: 3 of 12
17. (unload p4 t0 l5)
   deleted: (in p4 t0)
   added: (at p4 l5)
   goals met: 4 of 12
18. (load p6 t0 l5)
   deleted: (at p6 l5)
   added: (in p6 t0)
   goals met: 4 of 12
19. (drive t0 l5 l1 level59 level21 level80)
   deleted: (at t0 l5) (fuel t0 level80)
   added: (at t0 l1) (fuel t0 level59)
   goals met: 4 of 12
20. (load p1 t0 l1)
   deleted: (at p1 l1)
   added: (in p1 t0)
   goals met: 4 of 12
21. (unload p3 t0 l1)
   deleted: (in p3 t0)
   added: (at p3 l1)
   goals met: 5 of 12
22. (unload p6 t0 l1)
   deleted: (in p6 t0)
   added: (at p6 l1)
   goals met: 6 of 12
23. (drive t0 l1 l3 level48 level11 level59)
   deleted: (at t0 l1) (fuel t0 level59)
   added: (at t0 l3) (fuel t0 level48)
   goals met: 6 of 12
24. (load p8 t0 l3)
   deleted: (at p8 l3)
   added: (in p8 t0)
   goals met: 6 of 12
25. (unload p11 t0 l3)
   deleted: (in p11 t0)
   added: (at p11 l3)
   goals met: 7 of 12
26. (drive t0 l3 l4 level36 level12 level48)
   deleted: (at t0 l3) (fuel t0 level48)
   added: (at t0 l4) (fuel t0 level36)
   goals met: 7 of 12
27. (unload p0 t0 l4)
   deleted: (in p0 t0)
   added: (at p0 l4)
   goals met: 8 of 12
28. (unload p2 t0 l4)
   deleted: (in p2 t0)
   added: (at p2 l4)
   goals met: 9 of 12
29. (unload p8 t0 l4)
   deleted: (in p8 t0)
   added: (at p8 l4)
   goals met: 10 of 12
30. (drive t0 l4 l2 level11 level25 level36)
   deleted: (at t0 l4) (fuel t0 level36)
   added: (at t0 l2) (fuel t0 level11)
   goals met: 10 of 12
31. (unload p1 t0 l2)
   deleted: (in p1 t0)
   added: (at p1 l2)
   goals met: 11 of 12
32. (unload p5 t0 l2)
   deleted: (in p5 t0)
   added: (at p5 l2)
   goals met: 12 of 12
